CSI API ETABS v1

# cSapModelGridSys Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cGridSys GridSys { get; }

    ReadOnly Property GridSys As cGridSys
    	Get

    Dim instance As cSapModel
    Dim value As cGridSys

    value = instance.GridSys

    property cGridSys^ GridSys {
    	cGridSys^ get ();
    }

    abstract GridSys : cGridSys with get

#### Property Value

Type: cGridSys

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com